In [2]:
import pandas as pd

In [3]:
file = "Resources/sampleData.csv"

In [4]:
df_original = pd.read_csv(file)
df_original.head()

   id first_name   last_name       Phone Number      Time zone
0   1      Peter  Richardson    7-(789)867-9023  Europe/Moscow
1   2     Janice       Berry   86-(614)973-1727    Asia/Harbin
2   3     Andrea      Hudson   86-(918)527-6371  Asia/Shanghai
3   4     Arthur    Mcdonald  420-(553)779-7783  Europe/Prague
4   5      Kathy     Morales  351-(720)541-2124  Europe/Lisbon

In [9]:
df.describe()

               id
count  100.000000
mean    50.500000
std     29.011492
min      1.000000
25%     25.750000
50%     50.500000
75%     75.250000
max    100.000000

In [5]:
# Set new index to last_name
df = df_original.set_index("last_name")
df.head()

            id first_name       Phone Number      Time zone
last_name
Richardson   1      Peter    7-(789)867-9023  Europe/Moscow
Berry        2     Janice   86-(614)973-1727    Asia/Harbin
Hudson       3     Andrea   86-(918)527-6371  Asia/Shanghai
Mcdonald     4     Arthur  420-(553)779-7783  Europe/Prague
Morales      5      Kathy  351-(720)541-2124  Europe/Lisbon

In [6]:
# Grab the data contained within the "Berry" row and the "Phone Number" column
berry_phone = df.loc["Berry", "Phone Number"]
print("Using Loc: " + berry_phone)

also_berry_phone = df.iloc[1,2]
print("Using Iloc: " + also_berry_phone)

Using Loc: 86-(614)973-1727
Using Iloc: 86-(614)973-1727

In [7]:
"""
Grab the first five rows of data and the columns from "id" to "Phone Number"
When the index is not unique, all matches are returned
"""
row_l = ["Richardson", "Berry", "Hudson", "Mcdonald", "Morales"]
col_l = ["id", "first_name", "Phone Number"]
richardson_to_morales = df.loc[row_l,col_l]
print(richardson_to_morales)

print()

# iloc searches by row number and column number
also_richardson_to_morales = df.iloc[0:4,0:3] #row range, column range
print(also_richardson_to_morales)

            id first_name       Phone Number
last_name
Richardson   1      Peter    7-(789)867-9023
Richardson  25     Donald   62-(259)282-5871
Berry        2     Janice   86-(614)973-1727
Hudson       3     Andrea   86-(918)527-6371
Hudson       8    Frances   57-(752)864-4744
Hudson      90      Norma  351-(551)598-1822
Mcdonald     4     Arthur  420-(553)779-7783
Morales      5      Kathy  351-(720)541-2124

            id first_name       Phone Number
last_name
Richardson   1      Peter    7-(789)867-9023
Berry        2     Janice   86-(614)973-1727
Hudson       3     Andrea   86-(918)527-6371
Mcdonald     4     Arthur  420-(553)779-7783

In [10]:
# The following will select all rows for columns `first_name` and `Phone Number`
df.loc[:, ["first_name", "Phone Number"]].head()

           first_name       Phone Number
last_name
Richardson      Peter    7-(789)867-9023
Berry          Janice   86-(614)973-1727
Hudson         Andrea   86-(918)527-6371
Mcdonald       Arthur  420-(553)779-7783
Morales         Kathy  351-(720)541-2124

In [11]:
# Loc and Iloc also allow for conditional statments to filter rows of data
only_billys = df.loc[df["first_name"] == "Billy",:]
print(only_billys)

           id first_name      Phone Number       Time zone
last_name
Clark      20      Billy  62-(213)345-2549   Asia/Makassar
Andrews    23      Billy  86-(859)746-5367  Asia/Chongqing
Price      59      Billy  86-(878)547-7739   Asia/Shanghai

In [14]:
# Multiple conditions can be set to narrow down or widen the filter
only_billy_and_peter = df.loc[(df["first_name"] == "Billy") | (df["first_name"] == "Peter"), :]
print(only_billy_and_peter)

            id first_name      Phone Number       Time zone
last_name
Richardson   1      Peter   7-(789)867-9023   Europe/Moscow
Clark       20      Billy  62-(213)345-2549   Asia/Makassar
Andrews     23      Billy  86-(859)746-5367  Asia/Chongqing
Price       59      Billy  86-(878)547-7739   Asia/Shanghai